Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: in response to determining that the synchronization data indicates that the receive schedule is not in sync with the transmit schedule, adjust (604) the receive schedule of the wheel unit sensor.
de_de: in Reaktion auf ein Bestimmen, dass die Synchronisationsdaten angeben, dass der Empfangszeitplan nicht mit dem Übertragungszeitplan synchron ist, den Empfangszeitplan des Radeinheitssensors anzupassen (604).

source: The wheel unit sensor of claim 13 wherein determining (602) whether the synchronization data (650) within the message (550) indicates that the receive schedule (420) is in sync with a transmit schedule (652) of the master controller (405) includes determining (702) whether a message counter value (750) within the synchronization data (650) is outside a predetermined range;
de_de: Radeinheitssensor nach Anspruch 13, wobei ein Bestimmen (602), ob die Synchronisationsdaten (650) innerhalb der Nachricht (550) angeben, dass der Empfangszeitplan (420) mit einem Übertragungszeitplan (652) des Mastersteuergeräts (405) synchron ist, Bestimmen (702) einschließt, ob ein Nachrichtenzählerwert (750) innerhalb der Synchronisationsdaten (650) außerhalb eines vorbestimmten Bereichs ist;

source: The wheel unit sensor of claim 13 further comprising computer program instructions that when executed by the controller cause the controller to:
de_de: Radeinheitssensor nach Anspruch 13 ferner umfassend Computerprogrammanweisungen, die, wenn sie von dem Steuergerät ausgeführt werden, das Steuergerät dazu veranlassen:

source: in response to determining that the wireless receiver (403) did not receive a message (550) from the master controller (405), determine (802) when was the last time that the wireless receiver (403) received a message (550) from the master controller (405);
de_de: als Reaktion auf ein Bestimmen, dass der drahtlose Empfänger (403) keine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, zu bestimmen (802), wann der drahtlose Empfänger (403) das letzte Mal eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat;

source: determine (804) whether the last time that the wireless receiver (403) received a message (550) from the master controller (405) is beyond a predetermined interval (850);
de_de: zu bestimmen (804), ob das letzte Mal, dass der drahtlose Empfänger (403) eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, über ein vorbestimmtes Intervalls (850) hinausgeht;

source: in response to determining that the last time that the wireless receiver (403) received a message (550) from the master controller (405) is beyond the predetermined interval (850), add (806) an extended receive window (852) to the receive schedule (420);
de_de: als Reaktion auf ein Bestimmen, dass das letzte Mal, dass der drahtlose Empfänger (403) eine Nachricht (550) von dem Mastersteuergerät (405) empfangen hat, über das vorbestimmte Intervall (850) hinausgeht, ein erweitertes Empfangsfenster (852) zu dem Empfangszeitplan (420) hinzuzufügen (806);

source: determine (808) whether the receive schedule (420) of the wheel unit sensor (401) indicates that an extended receive window (852) has started; and
de_de: zu bestimmen (808), ob der Empfangszeitplan (420) des Radeinheitssensors (401) angibt, dass ein erweitertes Empfangsfenster (852) begonnen wurde; und

source: in response to determining that the receive schedule (420) indicates that the extended receive window (852) has started, turn-on (810) the wireless receiver (403) for the duration of the extended receive window (852).
de_de: als Reaktion auf ein Bestimmen, dass der Empfangszeitplan (420) angibt, dass das erweiterte Empfangsfenster (852) begonnen hat, den drahtlosen Empfänger (403) für die Dauer des erweiterten Empfangsfensters (852) einzuschalten (810).

source: What is claimed is:
de_de: Patentansprüche

source: 1. A device (100) for absorbing external impact forces, comprising:
de_de: 1. Vorrichtung (100) zum Dämpfen von externen Aufprallkräften, umfassend:

source: a collapsible elongated chamber (120) having a first wall (121) which resists circumferential expansion;
de_de: eine zusammenlegbare längliche Kammer (120) mit einer ersten Wand (121), die einer Ausdehnung in Umfangsrichtung widersteht;

source: a refill chamber (110) at least partially enclosing an outer surface of the first wall (121) of the collapsible elongated chamber (120), wherein said refill chamber (110) is configured to expand in response to an internal pressure;
de_de: eine Nachfüllkammer (110), die mindestens teilweise eine Außenfläche der ersten Wand (121) der zusammenlegbaren länglichen Kammer (120) umschließt, wobei die Nachfüllkammer (110) konfiguriert ist, um sich in Reaktion auf einen Innendruck auszudehnen;

source: a membrane (130) disposed between an inner surface of a wall (111) of the refill chamber (110) and an outer surface of the first wall (121);
de_de: eine Membran (130), die zwischen einer Innenfläche einer Wand (111) der Nachfüllkammer (110) und einer Außenfläche der ersten Wand (121) angeordnet ist;

source: a reservoir space (132) disposed between an inner surface of a wall of the refill chamber (110) and the outer surface of the first wall (121), wherein an interior of the collapsible elongated chamber (120) is in bidirectional fluidic communication with the reservoir space (132) via at least one orifice disposed through the first wall; and
de_de: einen Reservoirraum (132), der zwischen einer Innenfläche einer Wand der Nachfüllkammer (110) und der Außenfläche der ersten Wand (121) angeordnet ist, wobei ein Innenraum der zusammenlegbaren länglichen Kammer (120) über mindestens eine durch die erste Wand hindurch angeordnete Öffnung in bidirektionaler Fluidverbindung mit dem Reservoirraum (132) ist; und

source: an incompressible fluid contained in the interior of the collapsible elongated chamber, wherein the reservoir space (132) receives the incompressible fluid to expand the refill chamber (110) as the incompressible fluid flows from the interior of the chamber through the at least one orifice when the chamber is compressed by the external impact forces, whereby the impact forces are absorbed or dissipated by the device (100).
de_de: ein nichtkomprimierbares Fluid, das in dem Inneren der kollabierbaren länglichen Kammer enthalten ist, wobei der Reservoirraum (132) das nichtkomprimierbare Fluid aufnimmt, um die Nachfüllkammer (110) auszudehnen, sowie das nichtkomprimierbare Fluid aus dem Inneren der Kammer durch die mindestens eine Öffnung fließt, wenn die Kammer durch die äußeren Aufprallkräfte komprimiert wird, wodurch die Aufprallkräfte von der Vorrichtung (100) gedämpft oder abgeleitet werden.

source: 2. The device (100) of claim 1, wherein the wall of the refill chamber (110) is configured to circumferentially expand outward in a substantially radial direction in response to the internal pressure.
de_de: 2. Vorrichtung (100) nach Anspruch 1, wobei die Wand der Nachfüllkammer (110) konfiguriert ist, um sich in Reaktion auf den Innendruck in einer im Wesentlichen radialen Richtung nach außen auszudehnen.

source: 3. The device (100) of claim 1 or claim 2, wherein a wall of the refill chamber (110) comprises an elastic material.
de_de: 3. Vorrichtung (100) nach Anspruch 1 oder Anspruch 2, wobei eine Wand der Nachfüllkammer (110) ein elastisches Material umfasst.

source: 4. The device (100) of any one of claims 1-3, wherein the reservoir space (132) is in bidirectional fluid communication with an interior of a first collapsible elongated chamber and an interior of a second collapsible elongated chamber.
de_de: 4. Vorrichtung (100) nach einem der Ansprüche 1 bis 3, wobei der Reservoirraum (132) in bidirektionaler Fluidverbindung mit dem Inneren einer ersten zusammenlegbaren länglichen Kammer und dem Inneren einer zweiten zusammenlegbaren länglichen Kammer ist.

source: 5. The device (100) of any one of claims 1-4, wherein the incompressible fluid is water.
de_de: 5. Vorrichtung (100) nach einem der Ansprüche 1-4, wobei das nichtkomprimierbare Fluid Wasser ist.

source: 6. The device (100) of any one of claims 1-5, wherein the collapsible elongated chamber is axially collapsible.
de_de: 6. Vorrichtung (100) nach einem der Ansprüche 1-5, wobei die zusammenklappbare längliche Kammer axial zusammenklappbar ist.

source: 7. The device (100) of any one of claims 1-6, wherein an orifice of the at least one orifice is disposed through the first wall at a proximal end of the collapsible elongated chamber (120), optionally, wherein an orifice of the at least one orifice is disposed through the first wall at a proximal end of the collapsible elongated chamber (120), optionally, wherein an orifice of the at least one orifice is disposed through the first wall between the proximal end and the distal end of the collapsible elongated chamber (120).
de_de: 7. Vorrichtung (100) nach einem der Ansprüche 1-6, wobei eine Öffnung der mindestens einen Öffnung durch die erste Wand an einem proximalen Ende der zusammenlegbaren länglichen Kammer (120) angeordnet ist, optional, wobei eine Öffnung der mindestens einen Öffnung durch die erste Wand an einem proximalen Ende der zusammenlegbaren länglichen Kammer (120) angeordnet ist, optional, wobei eine Öffnung der mindestens einen Öffnung durch die erste Wand zwischen dem proximalen Ende und dem distalen Ende der zusammenlegbaren länglichen Kammer (120) angeordnet ist.

source: 8. The device (100) of any one of claims 1-7, wherein an orifice of the at least one orifice has a cross-sectional area of from 1 mm2 to 1,000 mm2.
de_de: 8. Vorrichtung (100) nach einem der Ansprüche 1-7, wobei eine Öffnung der mindestens einen Öffnung eine Querschnittsfläche von 1 mm2 bis 1.000 mm2aufweist.

source: 9. The device (100) of any one of claims 1-8, wherein the cross-sectional area of the collapsible elongated chamber (120) decreases linearly along a longitudinal axis of the device, from a proximal end to a distal end, optionally, wherein the cross-sectional area of the collapsible elongated chamber (120) decreases non-linearly along a longitudinal axis of the device, from a proximal end to a distal end.
de_de: 9. Vorrichtung (100) nach einem der Ansprüche 1-8, wobei die Querschnittsfläche der zusammenlegbaren länglichen Kammer (120) linear entlang einer Längsachse der Vorrichtung von einem proximalen Ende zu einem distalen Ende abnimmt, optional, wobei die Querschnittsfläche der zusammenlegbaren länglichen Kammer (120) nichtlinear entlang einer Längsachse der Vorrichtung von einem proximalen Ende zu einem distalen Ende abnimmt.

source: The device (100) of any of claims 1-9, wherein the membrane is a high-strength material.
de_de: Vorrichtung (100) nach einem der Ansprüche 1-9, wobei die Membran ein hochfestes Material ist.

source: The device (100) of any one of claims 1-10, wherein the membrane comprises a permeable material or an impermeable material, optionally, wherein at least a portion of the membrane is mechanically isotropic, optionally, wherein at least a portion of the membrane is mechanically anisotropic.
de_de: Vorrichtung (100) nach einem der Ansprüche 1-10, wobei die Membran ein durchlässiges Material oder ein undurchlässiges Material umfasst, optional, wobei mindestens ein Abschnitt der Membran mechanisch isotrop ist, optional, wobei mindestens ein Abschnitt der Membran mechanisch anisotrop ist.

source: The device (100) of any one of claims 1-11, wherein the collapsible elongated chamber (120) has an axial height of from 5 mm to 1,000 mm when undeformed, optionally, wherein the collapsible elongated chamber (120) has an axial height of from 10 mm to 50 mm when undeformed.
de_de: Vorrichtung (100) nach einem der Ansprüche 1-11, wobei die zusammenlegbare längliche Kammer (120) unverformt eine axiale Höhe von 5 mm bis 1.000 mm aufweist, optional, wobei die zusammenlegbare längliche Kammer (120) unverformt eine axiale Höhe von 10 mm bis 50 mm aufweist.

source: The device (100) of any one of claims 1-12, wherein the collapsible elongated chamber (120) has a maximum width perpendicular to a longitudinal axis of from 5 mm to 50 mm when undeformed.
de_de: Vorrichtung (100) nach einem der Ansprüche 1-12, wobei die zusammenlegbare längliche Kammer (120) unverformt eine maximale Breite senkrecht zu einer Längsachse von 5 mm bis 50 mm aufweist.

source: The device (100) of any one of claims 1-13, wherein a maximum width of a proximal end of the collapsible elongated chamber (120) is from 5 mm to 60 mm when undeformed, optionally, wherein a maximum width of a distal end of the collapsible elongated chamber (120) is from 5 mm to 60 mm when undeformed.
de_de: Vorrichtung (100) nach einem der Ansprüche 1-13, wobei eine maximale Breite eines proximalen Endes der zusammenlegbaren längliche Kammer (120) unverformt von 5 mm bis 60 mm ist, optional, wobei eine maximale Breite eines distalen Endes der zusammenlegbaren längliche Kammer (120) unverformt von 5 mm bis 60 mm ist.

source: The device (100) of any one of claims 1-14, further comprising an elastically compressible material (192) disposed within the first collapsible elongated chamber (1
de_de: Vorrichtung (100) nach einem der Ansprüche 1-14, ferner umfassend ein elastisch komprimierbares Material (192), das in der ersten zusammenlegbaren, länglichen Kammer

source: 20) and coupled to an inner surface of the first wall at a proximal end of the device.
de_de: (120) angeordnet ist und mit einer Innenfläche der ersten Wand an einem proximalen Ende der Vorrichtung gekoppelt ist.

source: 1. A digital power supply (200) for an electric grill, grill (110), the digital power supply comprising:
de_de: 1. Digitale Stromversorgung (200) für einen elektrischen Grill (110), wobei die digitale Stromversorgung umfasst:

source: a first user input (101) for receiving a first user-selected operating mode;
de_de: einen ersten Benutzereingang (101) zum Empfangen eines ersten benutzer-gewählten Betriebsmodus;

source: a first heating element (203) connected to a voltage line (201) and further connected to a first triac (208);
de_de: ein erstes Heizelement (203), das mit einer Spannungsleitung (201) verbunden ist und ferner mit einem ersten Triac (208) verbunden ist;

source: a second user input (102) for receiving a second user-selected operating mode;
de_de: einen zweiten Benutzereingang (102) zum Empfangen eines zweiten benutzer-gewählten Betriebsmodus;

source: a second heating element (204) connected to the voltage line and further connected to a second triac (209); and
de_de: ein zweites Heizelement (204), das mit der Spannungsleitung verbunden ist und ferner mit einem zweiten Triac (209) verbunden ist; und

source: a microprocessor (213) connected to a memory (1000); to the first user input, to the second user input, to the first triac, and to the second triac, wherein the microprocessor is to execute instructions to cause the microprocessor to at least:
de_de: einen Mikroprozessor (213), der mit einem Speicher (1000), mit dem ersten Benutzereingang, mit dem zweiten Benutzereingang, mit dem ersten Triac und mit dem zweiten Triac verbunden ist, wobei der Mikroprozessor Anweisungen ausführt, um den Mikroprozessor zu veranlassen, mindestens:

source: determine a first amount of power requested based on the first user-selected operating mode from the first user input;
de_de: eine erste angeforderte Leistungsmenge auf der Grundlage des ersten benutzer-gewählten Betriebsmodus aus dem ersten Benutzereingang zu bestimmen;

source: determine a second amount of power requested based on the second user-selected operating mode from the second user input;
de_de: eine zweite angeforderte Leistungsmenge auf der Grundlage des zweiten benutzer-gewählten Betriebsmodus aus dem zweiten Benutzereingang zu bestimmen;

source: store, in the memory, a first power array and a second power array, each of the first power array and the second power array including numeric values based on a total power requested;
de_de: ein erstes Leistungsarray und ein zweites Leistungsarrays in dem Speicher zu speichern, wobei ein jeweiliges des ersten Leistungsarrays und des zweiten Leistungsarrays numerische Werte auf der Grundlage einer angeforderten Gesamtleistung beinhaltet;

source: calculate a first ratio as the first amount of power requested divided by a total amount of power requested;
de_de: ein erstes Verhältnis als die erste Menge angeforderter Leistung geteilt durch eine Gesamtmenge angeforderter Leistung zu berechnen;

source: calculate a second ratio as the second amount of power requested divided by the total amount of power requested;
de_de: ein zweites Verhältnis als die zweite Menge angeforderter Leistung geteilt durch die Gesamtmenge angeforderter Leistung zu berechnen;

source: calculate a first duration of a first time period based on the first ratio multiplied by a preconfigured amount of time;
de_de: eine erste Dauer eines ersten Zeitraums auf der Grundlage des ersten Verhältnisses multipliziert mit einer vorkonfigurierten Zeitspanne zu berechnen;

source: calculate a second duration of a second time period based on the second ratio multiplied by the preconfigured amount of time;
de_de: eine zweite Dauer eines zweiten Zeitraums auf der Grundlage des zweiten Verhältnisses multipliziert mit der vorkonfigurierten Zeitspanne zu berechnen;

source: control the first triac to deliver, for the first duration of the first time period, a first phase-controlled AC wave pattern represented by the first power array to the first heating element;
de_de: den ersten Triac zu steuern, um für die erste Dauer der ersten Zeitperiode ein erstes phasengesteuertes Wechselstromwellenmuster, das durch das erste Leistungsarray dargestellt wird, an das erste Heizelement zu liefern;

source: control the second triac to deliver, for the first duration of the first time period, a second phase-controlled AC wave pattern represented by the second power array to the second heating element;
de_de: den zweiten Triac zu steuern, um für die erste Dauer der ersten Zeitperiode ein zweites phasengesteuertes Wechselstromwellenmuster, das durch das zweite Leistungsarray dargestellt wird, an das zweite Heizelement zu liefern;

source: control the first triac to deliver, for the second duration of the second time period, the second phase-controlled AC wave pattern represented by the second power array to the first heating element; and
de_de: den ersten Triac zu steuern, um für die zweite Dauer der zweiten Zeitperiode das zweite phasengesteuerte Wechselstromwellenmuster, das durch das zweite Leistungsarray dargestellt wird, an das erste Heizelement zu liefern;

source: control the second triac to deliver, for the second duration of the second time period, the first phase-controlled AC wave pattern represented by the first power array to the second heating element.
de_de: den zweiten Triac zu steuern, um für die zweite Dauer der zweiten Zeitperiode das erste phasengesteuerte Wechselstromwellenmuster, das durch das erste Leistungsarray dargestellt wird, an das zweite Heizelement zu liefern.

source: 2. The digital power supply of claim 1, wherein the total power requested is the combination of the first amount of power requested and the second amount of power requested.
de_de: 2. Digitale Stromversorgung nach Anspruch 1, wobei die angeforderte Gesamtleistung die Kombination aus der ersten angeforderten Leistungsmenge und der zweiten angeforderten Leistungsmenge ist.

source: 3. The digital power supply of claim 1, wherein each numeric value of the first power array is between 0 ≤ x ≤ 1.0.
de_de: 3. Digitale Stromversorgung nach Anspruch 1, wobei jeder numerische Wert des ersten Leistungsarrays zwischen 0 ≤ x ≤ 1,0 ist.

source: 4. The digital power supply of claim 1, wherein the microprocessor is to execute the instructions to cause the microprocessor to compute a phase angle array based on the first power array, wherein each numeric value of the first phase angle array corresponds to a numeric value of the first power array using the equation arccos (2x-1).
de_de: 4. Digitale Stromversorgung nach Anspruch 1, wobei der Mikroprozessor die Anweisungen ausführen soll, um den Mikroprozessor zu veranlassen, ein Phasenwinkelarray auf der Grundlage des ersten Leistungsarrays zu berechnen, wobei jeder numerische Wert des ersten Phasenwinkelarrays einem numerischen Wert des ersten Leistungsarrays unter Verwendung der Gleichung arccos (2x-1) entspricht.

source: 5. The digital power supply of claim 4, wherein each numeric value of the first phase angle array represents a phase-angle cut of one phase-controlled AC wave.
de_de: 5. Digitale Stromversorgung nach Anspruch 4, wobei jeder numerische Wert des ersten Phasenwinkelarrays einen Phasenwinkelschnitt einer phasengesteuerten Wechselstromwelle darstellt.

source: 6. The digital power supply of claim 5, wherein each alternate value of the first power array is "0" and represents an "off" wave, such that the first phase-controlled AC wave pattern includes a phase-controlled AC wave followed by an "off" wave.
de_de: 6. Digitale Stromversorgung nach Anspruch 5, wobei jeder alternative Wert des ersten Leistungsarrays "0" ist und eine "Aus"-Welle darstellt, sodass das erste phasengesteuerte Wechselstromwellenmuster eine phasengesteuerte Wechselstromwelle gefolgt von einer "Aus"-Welle beinhaltet.

source: 7. The digital power supply of claim 5, wherein each alternate value of the first power array is "1.0" and represents a full "on" wave, such that the first phase-controlled AC wave pattern includes a phase-controlled AC wave followed by an "on" wave.
de_de: 7. Digitale Stromversorgung nach Anspruch 5, wobei jeder alternative Wert des ersten Leistungsarrays "1,0" ist und eine vollständige "Ein"-Welle darstellt, sodass das erste phasengesteuerte Wechselstromwellenmuster eine phasengesteuerte Wechselstromwelle gefolgt von einer "Ein"-Welle beinhaltet.

source: 8. A method for delivering power to an electric grill, the method comprising:
de_de: 8. Verfahren zum Versorgen eines elektrischen Grills mit Strom, wobei das Verfahren Folgendes umfasst:

source: determining a first amount of power requested based on a first user-selected operating mode at a first user input device;
de_de: Bestimmen einer ersten angeforderten Leistungsmenge auf der Grundlage eines ersten benutzer-gewählten Betriebsmodus aus einer ersten Benutzereingangsvorrichtung;

source: determining a second amount of power requested based on a second user-selected operating mode at a second user input device;
de_de: Bestimmen einer zweite angeforderte Leistungsmenge auf der Grundlage eines zweiten benutzer-gewählten Betriebsmodus aus einer zweiten Benutzereingangsvorrichtung zu bestimmen;

source: connecting a first heating element to a voltage line and to a first triac;
de_de: Verbinden eines ersten Heizelements mit einer Spannungsleitung und mit einem ersten Triac;

source: connecting a second heating element to the voltage line and a second triac;
de_de: Verbinden eines zweiten Heizelements mit einer Spannungsleitung und mit einem zweiten Triac;

source: storing, in the memory, a first power array and a second power array, the first power array and the second power array each including numeric values based on a total power requested;
de_de: Speichern eines ersten Leistungsarrays und eines zweiten Leistungsarrays in dem Speicher, wobei ein jeweiliges des ersten Leistungsarrays und des zweiten Leistungsarrays numerische Werte auf der Grundlage einer angeforderten Gesamtleistung beinhaltet;
